Jiaocq/ST/STM32F1/103zefree_hal/Src/Backup/lsm6dsl_reg.h
/*
 ******************************************************************************
 * @file    lsm6dsl_reg.h
 * @author  MEMS Software Solution Team
 * @brief   This file contains all the functions prototypes for the
 *          lsm6dsl_reg.c driver.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2018 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LSM6DSL_DRIVER_H
#define LSM6DSL_DRIVER_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>

/** @addtogroup lsm6dsl
 * @{
 */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

/** @defgroup ST_MEMS_common_types
  * @{
  */

/**
  * Float typedef definition for compliance with:
  * MISRA-C 2012 [Dir 4.6a] -> " Basic type used without typedef "
  *
  */
typedef float float32_t;

typedef union
{
  int16_t i16bit[3];
  uint8_t u8bit[6];
} axis3bit16_t;

typedef union
{
  int16_t i16bit;
  uint8_t u8bit[2];
} axis1bit16_t;

typedef union
{
  int32_t i32bit[3];
  uint8_t u8bit[12];
} axis3bit32_t;

typedef union
{
  int32_t i32bit;
  uint8_t u8bit[4];
} axis1bit32_t;

typedef struct
{
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
} bitwise_t;

#define PROPERTY_DISABLE                (0)
#define PROPERTY_ENABLE                 (1)

#endif /* MEMS_SHARED_TYPES*/

/**
  * @}
  */

/** @defgroup lsm6dsl_interface
  * @{
  */

typedef int32_t (*lsm6dsl_write_ptr)(void *, uint8_t, uint8_t *, uint16_t);
typedef int32_t (*lsm6dsl_read_ptr)(void *, uint8_t, uint8_t *, uint16_t);

typedef struct
{
  /** Component mandatory fields **/
  lsm6dsl_write_ptr  write_reg;
  lsm6dsl_read_ptr   read_reg;
  /** Customizable optional pointer **/
  void *handle;
} lsm6dsl_ctx_t;

/**
  * @}
  */

/** @defgroup lsm6dsl_Infos
  * @{
  */

/** I2C Device Address 8 bit format  if SA0=0 -> D5 if SA0=1 -> D7 **/
#define LSM6DSL_I2C_ADD_L     0xD5
#define LSM6DSL_I2C_ADD_H     0xD7

/** Device Identification (Who am I) **/
#define LSM6DSL_ID            0x6AU

/**
  * @}
  */

/**
  * @defgroup lsm6dsl_Sensitivity
  * @{
  */

#define LSM6DSL_FROM_FS_2g_TO_mg(lsb)    (float)(lsb *  61.0f) / 1000.0f
#define LSM6DSL_FROM_FS_4g_TO_mg(lsb)    (float)(lsb * 122.0f) / 1000.0f
#define LSM6DSL_FROM_FS_8g_TO_mg(lsb)    (float)(lsb * 244.0f) / 1000.0f
#define LSM6DSL_FROM_FS_16g_TO_mg(lsb)   (float)(lsb * 488.0f) / 1000.0f

#define LSM6DSL_FROM_FS_125dps_TO_mdps(lsb)    (float)(lsb * 4375.0f) / 1000.0f
#define LSM6DSL_FROM_FS_250dps_TO_mdps(lsb)    (float)(lsb *  875.0f) / 1000.0f
#define LSM6DSL_FROM_FS_500dps_TO_mdps(lsb)    (float)(lsb * 1750.0f) / 1000.0f
#define LSM6DSL_FROM_FS_1000dps_TO_mdps(lsb)   (float)(lsb *   35.0f) / 1000.0f
#define LSM6DSL_FROM_FS_2000dps_TO_mdps(lsb)   (float)(lsb *   70.0f) / 1000.0f

#define LSM6DSL_FROM_LSB_TO_degC(lsb)   ((float)((int16_t)lsb>>8)*1.0f + 25.0f)

/**
  * @}
  */

#define LSM6DSL_FUNC_CFG_ACCESS              0x01
typedef struct
{
  uint8_t not_used_01              : 5;
  uint8_t func_cfg_en              : 3;  /* func_cfg_en + func_cfg_en_b */
} lsm6dsl_func_cfg_access_t;

#define LSM6DSL_SENSOR_SYNC_TIME_FRAME       0x04
typedef struct
{
  uint8_t tph                      : 4;
  uint8_t not_used_01              : 4;
} lsm6dsl_sensor_sync_time_frame_t;

#define LSM6DSL_SENSOR_SYNC_RES_RATIO        0x05
typedef struct
{
  uint8_t rr                       : 2;
  uint8_t not_used_01              : 6;
} lsm6dsl_sensor_sync_res_ratio_t;

#define LSM6DSL_FIFO_CTRL1                   0x06
typedef struct
{
  uint8_t fth                      : 8;  /* + FIFO_CTRL2(fth) */
} lsm6dsl_fifo_ctrl1_t;

#define LSM6DSL_FIFO_CTRL2                   0x07
typedef struct
{
  uint8_t fth                      : 3;  /* + FIFO_CTRL1(fth) */
  uint8_t fifo_temp_en             : 1;
  uint8_t not_used_01              : 2;
  uint8_t  timer_pedo_fifo_drdy    : 1;
  uint8_t timer_pedo_fifo_en       : 1;
} lsm6dsl_fifo_ctrl2_t;

#define LSM6DSL_FIFO_CTRL3                   0x08
typedef struct
{
  uint8_t dec_fifo_xl              : 3;
  uint8_t dec_fifo_gyro            : 3;
  uint8_t not_used_01              : 2;
} lsm6dsl_fifo_ctrl3_t;

#define LSM6DSL_FIFO_CTRL4                   0x09
typedef struct
{
  uint8_t dec_ds3_fifo             : 3;
  uint8_t dec_ds4_fifo             : 3;
  uint8_t only_high_data           : 1;
  uint8_t stop_on_fth              : 1;
} lsm6dsl_fifo_ctrl4_t;

